# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [4.87787,   6.35631, 12.91158,   9.03208, 7.15285,  18.29766]
  - [15.59967,  22.33371, 35.73561,  19.68820, 21.02688,  47.27071]
  - [40.85436,  39.83278, 38.59727,  78.41331, 81.68491,  46.31688]
  - [69.72626,  85.14220, 70.14906, 160.70825, 124.91834, 114.23557]
  - [206.45392,  86.47435, 170.41608, 228.14876, 262.37347, 175.54692]
  # - [10,10, 10,10, 10,10]
# mobilenetv2 backbone
backbone:
  # [from, number, module, args]
  # Conv args [filters, ksize, stride]
  # QuantConvBNReLU args [filters, ksize, stride=1, padding=None, weight_bitts=8, act_bits=8, groups=1]
  # InvertedResidual args [out_channels, stride, expand_ratio]
  # QuantDwsConv args [out_channels, stride=1, padding=None, w, a]
  [[-1, 1, QuantConvBNReLU, [32, 3, 2]],          # 0 stride 2

   [-1, 1, QuantInvertedResidual, [16, 1, 1, 4, 4, True]],

   [-1, 1, QuantInvertedResidual, [24, 2, 6, 4, 4, True]],    # 2 stride 4
   [-1, 1, QuantInvertedResidual, [24, 1, 6, 4, 4, True]],

   [-1, 1, QuantInvertedResidual, [32, 2, 6, 4, 4, True]],    # 4 stride 8
   [-1, 2, QuantInvertedResidual, [32, 1, 6, 4, 4, True]],

   [-1, 1, QuantInvertedResidual, [64, 2, 6, 4, 4, True]],        # 6 stride 16
   [-1, 3, QuantInvertedResidual, [64, 1, 6, 4, 4, True]],

   [-1, 1, QuantInvertedResidual, [96, 1, 6, 4, 4, True]],       # 8 stride 16
   [-1, 2, QuantInvertedResidual, [96, 1, 6, 4, 4, True]],

   [-1, 1, QuantInvertedResidual, [160, 2, 6, 4, 4, True]],      # 10 stride 32
   [-1, 2, QuantInvertedResidual, [160, 1, 6, 4, 4, True]],  

   [-1, 1, QuantInvertedResidual, [320, 1, 6, 4, 4, True]],     # 12 stride 32

   [-1, 1, QuantConvBNReLU, [1024, 1, 1, None, 4, 4]],          # 13 stride 32
  ]


# YOLOv3 head
head:
  [
   [-1, 1, QuantDwsConv, [1024, 2, None, 4, 4]],                 # 14 stride 64
   [-1, 1, QuantDwsConv, [512, 2, None, 4, 4]],                 # 15 stride 128
  #  [-1, 1, QuantDwsConv, [512, 2]], 
   [-1, 1, QuantDwsConv, [256, 2, None, 4, 4]], 
   [[9, 13, 14, 15, 16], 1, QuantDetect, [nc, anchors, 8]],   # Detect(P3, P4, P5)
  #  [[16], 1, QuantDetect, [nc, anchors, 8]],   # Detect(P3, P4, P5)
  ]

features_to_save: [13]